app/controllers/api/v1/graphs_controller.rb

SELECT "graphs".* FROM "graphs"
---
  def index
    @graphs = Graph.all

SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def show
    @graph = Graph.find(params[:id])

INSERT INTO "graphs" ("title", "compound_period", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["compound_period", 12], ["created_at", "2019-05-07 23:45:08.105632"], ["updated_at", "2019-05-07 23:45:08.105632"]]
---
  def create
    @graph = Graph.new(graph_params)
    @graph.save

SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "graphs" SET "title" = $1, "principal" = $2, "monthly_contribution" = $3, "updated_at" = $4 WHERE "graphs"."id" = $5  [["title", "four"], ["principal", 10000.0], ["monthly_contribution", 100.0], ["updated_at", "2019-05-08 18:47:49.823038"], ["id", 15]]
SELECT "data_points".* FROM "data_points" WHERE "data_points"."graph_id" = $1  [["graph_id", "3"]]
SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "data_points" ("graph_id", "year", "created_at", "updated_at", "amount") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["graph_id", "2"], ["year", 0], ["created_at", "2019-05-07 22:53:08.084267"], ["updated_at", "2019-05-07 22:53:08.084267"], ["amount", 10000.0]]
---
  def update
    @graph = Graph.find(params[:id])
    @graph.update(graph_params)
    @graph.remove_old_data_points
    @graph = Graph.find(params[:id])
    @graph.create_data

SELECT  "graphs".* FROM "graphs" WHERE "graphs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "graphs" WHERE "graphs"."id" = $1  [["id", 6]]
---
  def destroy
    @graph = Graph.find(params[:id])
    @graph.destroy