app/models/graph.rb

  def create_data_point(graph_id, year, amount)
    data_point = DataPoint.new()
    data_point.graph_id = graph_id
    data_point.year = year
    data_point.amount = amount
    data_point.save
---
INSERT INTO "data_points" ("graph_id", "year", "created_at", "updated_at", "amount") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["graph_id", "18"], ["year", "0"], ["created_at", "2019-05-06 23:48:19.233276"], ["updated_at", "2019-05-06 23:48:19.233276"], ["amount", 1000.0]]

  def remove_old_data_points
    self.data_points.each do |point|
      point.destroy
---
SELECT "data_points".* FROM "data_points" WHERE "data_points"."graph_id" = $1  [["graph_id", "3"]]
DELETE FROM "data_points" WHERE "data_points"."id" = $1  [["id", 43]]